---
type: NestedFamilyTypeReference
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# NestedFamilyTypeReference

`Autodesk.Revit.DB.NestedFamilyTypeReference` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CategoryId | 2016 | `public ElementId CategoryId { get ; }` |
| Property | FamilyName | 2016 | `public string FamilyName { get ; }` |
| Property | Parameter | — | `` |
| Property | TypeName | 2016 | `public string TypeName { get ; }` |